/* 
  Localizable.strings (English)
  AMD Power Gadget
*/

/* NOTE: Some keys use Spanish text for historical reasons. */
/* These are used as lookup identifiers and work correctly. */
/* A future refactor should standardize all keys to English. */

"Dashboard" = "Kontrollpanel";
"Telemetry" = "Telemetri";
"Fan Control" = "Vifte kontroll";
"Profiles" = "Profiles";
"Advanced" = "Avansert";
"Menu Bar" = "Meny Bar";
"System Info" = "System informasjon";
"Desktop Widgets" = "Skrivebord Widgeter";

"AMD Power" = "AMD Kraft";
"Gadget" = "Gadget";

"CPU" = "Prosessor";
"GPU" = "GPU";
"Freq" = "Freq";
"Average" = "Gjennomsnitt";
"Avg: %@" = "Avg: %@";
"Collecting data…" = "Henter data…";

"Low Power Mode (LPM)" = "Lav strømmodus (LPM)";
"Allows macOS to auto-manage CPU frequency" = "Lar macOS automatisk behandle CPU-frekvens";
"Forces CPU to lowest frequency for minimum power" = "Krefter CPU til laveste frekvens for minste effekt";
"Core Performance Boost (CPB)" = "Kjernefunksjon Boost (CPB)";
"Update Interval" = "Oppdater intervall";
"Adjust how frequently telemetry data updates. Lower = more responsive, higher = less CPU usage." = "Juster hvor ofte telemetridata oppdateringer. Lavere = mer respondere, høyere = mindre CPU-bruk.";

"Opciones en Menú Bar" = "Valg for menylinje";
"Choose which items appear in the menu bar. Changes apply immediately." = "Velg hvilke elementer som vises i menylinjen. Endringer vil gjelde umiddelbart.";
"Customize the visual appearance of the menu bar items." = "Tilpass utseendet på menylinjens elementer.";
"Límite de Temp de Alerta" = "Grense for varsel midlertidig";
"Color de Alerta de Temp" = "Farge for varslingstall";
"Color de Flechas" = "Farge på piler";
"Additional telemetry for the menu bar." = "Ekstra telemetri for menylinjen.";
"GPU data is shown inside Temp, Power, Memory and Fan columns when enabled." = "GPU-data blir vist inne i Temp, Power, Memory og Fan kolonner når aktivert.";
"Show GPU VRAM" = "Vis GPU VRAM";
"G:X.XG in Memory column" = "G:X.XG i minnekolonne";
"Show GPU Fan Speed" = "Vis GPU Fan hastighet";
"G:XXXX in Fan column" = "G:XXXX i Viftekalonne";

"No fans detected." = "Ingen vifter funnet.";
"SMC driver not available" = "SMC-driver er ikke tilgjengelig";
"Your SMC chip may not be supported." = "SMC-chipen støttes ikke.";
"RPM" = "RPM";
"Throttle" = "Halttel";
"↩ Reset to Auto" = ": Tilbakestille til Auto";

"Select a profile to adjust the CPU operating range. Changes take effect immediately." = "Velg en profil for å justere CPU-spennet. Endringer trer i kraft umiddelbart.";

"Directly edit raw P-State registers. Requires kext privilege check disabled via boot-arg or root." = "Direkte redigere rå P-Stat registreringer. Krever kext privilegium avkrysning deaktivert via boot-arg eller root.";
"This will write the raw P-State definitions directly to the CPU. Proceed?" = "Dette vil skrive de rå P-stat-definisjonene direkte til CPU. Fortsett?";
"Disabled — work in progress" = "Deaktivert — pågående arbeid";
"WIP" = "WIP";

"Enable in OC: Misc → Security → ExposeSensitiveData = 0x08" = "Aktiver i OC: Misc → Sikkerhet → EksponeringsSensitiveData = 0 x 08";
"Motherboard info not available" = "Hovedtavleinformasjon er ikke tilgjengelig";

"Vista previa de la Barra de Menús:" = "Forhåndsvisning av menylinje:";
"Ancho estimado: %dpt" = "Bredde: %d";
"Restart the app to fully apply width changes." = "Start appen på nytt for å bruke breddeendringer.";
"Small (%dpt)" = "Liten (%dpt)";
"Medium (%dpt)" = "Medium (%dpt)";
"Large (%dpt)" = "Stor (%dpt)";

"Green" = "Grønn";
"Blue" = "Blå";
"Orange" = "Oransje";
"Red" = "Rød";
"Purple" = "Lilla";
"Pink" = "Rosa";
"Teal" = "Blågrønn";
"Turquoise" = "Turquoise";

"Verde" = "Grønn";
"Azul" = "Blå";
"Naranja" = "Oransje";
"Rojo" = "Rød";
"Morado" = "Lilla";
"Rosa" = "Rosa";
"Turquesa" = "Blågrønn";

"Dynamic Colors (Temp Only)" = "Dynamiske farger (kun Temp)";
"Temp Alert Color" = "Temp Varselfarge";
"Temp Alert Limit" = "Temp varslingsgrense";
"Network" = "Nettverk";
"Network Arrows Color" = "Farge for nettverks piler";
"Exit" = "Avslutt";
"AMD Power Gadget" = "AMD Strøm Gadget";
"AMD Power Tool" = "AMD strømverktøy";
"SMC Fans" = "SMC Vifter";

"Fan 1" = "Vifte 1";
"Fan 2" = "Vifte 2";
"Fan 3" = "Vifte 3";
"Fan 4" = "Vifte 4";
"Fan 5" = "Vifte 5";
"Fan 6" = "Vifte 6";
"Fan 7" = "Vifte 7";
"Fan 8" = "Vifte 8";

/* Alerts */
"To enable motherboard display:" = "For å aktivere hovedtavlesning:";
"Open your OpenCore config file,\n\nGo to Misc -> Security -> ExposeSensitiveData,\n\nSet the value to 0x08 to expose board information." = "Åpne din OpenCore config fil,\n\nGå til Misc -> Sikkerhet -> ExposeSensitiveData,\n\nSett verdien til 0x08 for å eksponere tavlinformasjon.";
"Done" = "Ferdig";
"Invalid Input" = "Invalid Input";
"Please type in numbers in hexadecimal." = "Skriv inn tall i hexadecimal.";
"Unable to Set PStateDef" = "Kan ikke sette PStateDef";
"Action was denied as current user does not have enough privilege,\nor was canceled by current user.\n\nRun AMD Power Gadget as root user or disable privilege check with boot-arg '-amdpnopchk'\n\nOtherwise, click 'Once' in the warning message to allow this change." = "Handling ble avvist som gjeldende bruker ikke har nok privilegier,\neller ble avbrutt av gjeldende bruker.\n\nKjør AMD Power Gadget som rot bruker eller deaktiver privilegium sjekk med boot-arg '-amdpnopchk'\n\nEllers Klikk «Ende» i varselmeldingen for å tillate denne endringen.";
"Your changes will not be saved" = "Endringene dine vil ikke bli lagret";
"Click apply to save changes before closing this windows." = "Klikk for å lagre endringer før du lukker disse vinduene.";
"Cancel" = "Avbryt";
"Close without saving" = "Lukk uten å lagre";
"Invalid File" = "Ugyldig fil";
"The selected file could not be read or is not a valid pstate file." = "Den valgte filen kunne ikke leses eller er ikke en gyldig pstate fil.";
"OK" = "Ok";

/* Dynamic format strings */
"Avg: %.2f GHz, Max: %.2f GHz" = "Avg: %.2f GHz, Maksimum: %.2f GHz";
"%.2f °C" = "%.2f °C";
"%.2f Watt" = "%.2f W";

/* Session Peaks */
"Session Peaks" = "Økt topper";
"Reset Peaks" = "Tilbakestill Topp";

/* GPU Fan Control */
"GPU Fan Control (Zero RPM / Curves)" = "GPU Fan Kontroll (Zero RPM / kurser)";
"macOS Hardware Limitation" = "Begrensning for macOS maskinvare";
"Direct software-based GPU fan speed overrides (such as zero-rpm toggle or drawing fan curves in macOS) are not supported by the macOS kernel/IOKit driver for AMD GPUs. The GPU's onboard firmware (vBIOS) manages the fans." = "Direkte programvare-baserte GPU-vifte-overstyringer (som null-rpm veksling eller tegning av viftekurver i macOS) støttes ikke av macOS kernel/IOKS-driver for AMD GPUs. Fastvaren til GPUs om bord (vBIOS) styrer viftene sine.";
"Standard Hackintosh Solution:" = "Standard Hackintosh løsning:";
"The only way to modify this behavior (like forcing fans to spin at lower temperatures or disabling Zero RPM) is by exporting the vBIOS, creating a Soft PowerPlay Table (SPPT), and injecting it via OpenCore's config.plist under DeviceProperties." = "Den eneste måten å endre denne atferden (som å tvinge fans til å spinne ved lavere temperaturer eller deaktivere Zero RPM) ved å eksportere vBIOS, ved å lage en Soft PowerPlay tabell (SPPT), og injisere den via OpenCores konfigurasjon. List opp under enheters egenskaper.";
"Open SPPT Guide" = "Åpne SPPT guide";
"MorePowerTool" = "MorePowerTool";

/* CPPC & EPP */
"Native CPPC Active Mode (EPP)" = "Lokal CPPC aktiv modus (EPP)";
"Enables autonomous hardware frequency scaling (recommended)" = "Aktiverer autonom maskinvarefrekvensskalering (anbefales)";
"Power Management Mode" = "Strøm behandling modus";
"Energy Preference (EPP)" = "Energiinnstilling (EPP)";
"Select a hardware autonomous profile. The CPU will scale frequency dynamically." = "Velg en maskinvare autonom profil. CPU vil skalere frekvensen dynamisk.";
"Performance" = "Ytelse";
"Balanced Perf" = "Balansert Perf";
"Balanced Power" = "Balansert makt";
"Power Save" = "Strømsparing";
"Active Profile Status" = "Aktiv profil status";
"CPU Speed Profiles (Legacy)" = "CPU Speed Profiler (Legacy)";
"Select a manual P-State override profile. Frequencies will be restricted to the selected step." = "Velg en manuell P-tilstand overstyrer profilen. Frekvenser vil bli begrenset til det valgte trinnet.";
"Mode" = "Modus";
"EPP Profile" = "EPP profil";

/* Desktop Widgets */
"Show CPU Widget" = "Vis CPU-widget";
"Show GPU Widget" = "Vis GPU widget";
"Show RAM Widget" = "Show RAM Widget";
"Show Disk Widget" = "Vis diskwidget";
"Show Network Widget" = "Vis nettverkswidget";
"Show Fan Widget" = "Vis vifte Widget";
"Disable All Widgets" = "Deaktiver alle widgets";
"Sort by Rank" = "Sorter etter rangering";
"Edit Widget Layout" = "Rediger Widget layout";
"Unlock widgets to drag them around the screen" = "Lås opp moduler for å dra dem rundt skjermen";
"Widget Options" = "Widget Alternativer";
"Customize the appearance and behavior of your desktop widgets." = "Tilpass utseendet og virkemåten til skrivebordsmodulene.";
"Auto-Align Active Widgets" = "Automatisk justere aktive widgets";
"Automatically stack active widgets at a corner" = "Automatisk stack aktive widgets på et hjørne";
"Alignment Corner" = "Justering hjørne";
"Top Right" = "Øverst til høyre";
"Top Left" = "Øverst til venstre";
"Bottom Right" = "Nederst til høyre";
"Bottom Left" = "Nederst til venstre";
"Show Clock Widget" = "Vis klokke widget";
"Clock" = "Klokke";
"Stats Table" = "Statistikk tabell";
"Classic Glass" = "Klassisk glass";
"Pro Monitor" = "Pro Monitor";
"Core Matrix" = "Kjerne matrise";

"United" = "Forent";
"Show United Widget" = "Vis United Widget";
"Configure Combined Metrics" = "Konfigurer kombinert måltall";
"Include CPU" = "Inkluder CPU";
"Include GPU" = "Inkluder GPU";
"Include RAM" = "Inkluder RAM";
"Include Disk" = "Inkluder disk";
"Include Network" = "Inkluder nettverk";
"Include Fan" = "Inkluder vifte";

"Temas & Apariencia" = "Temaer & utseende";
"Análisis" = "Analyse";

"Select Visual Theme (Instant Application)" = "Velg visuelt tema (øyeblikkelig applikasjon)";
"Custom Theme Creator & Exchange (JSON)" = "Egendefinert tema skaper & Exchange-(JSON)";
"Chart Rendering Style" = "Stil for kartgjengivelse";
"Custom Theme Editor" = "Egendefinert tema editor";
"Showing active theme colors. Adjust any color to customize." = "Viser aktive temafarger. Juster farge til tilpasning.";
"Use the Opacity slider for transparency (macOS color panel alone often resets alpha)." = "Bruk glidebryteren for gjennomsiktighet (macOS fargepanel bare tilbakestiller ofte alfa).";
"Opacity" = "Opasitet";
"Edit Active Theme" = "Rediger aktivt tema";
"Export Theme (JSON)" = "Eksporter tema (JSON)";
"Import Theme (JSON)" = "Importer tema (JSON)";
"Card Background" = "Kort bakgrunn";
"Cyan Accent" = "Cyanfarget andel";
"Orange Accent" = "Oransje kule";
"Green Accent" = "Grønn prosentandel";
"Purple Accent" = "Lilla andel";

/* ===== Auto-extracted / curated for Crowdin (v3.16.1+) ===== */
"%.0f" = "%.0f";
"%.0f K/s" = "%.0f K/s";
"%.0f MHz" = "%.0f MHz";
"%.0f%%" = "%.0f%%";
"%.0fG" = "%.0fG";
"%.0f°" = "%.0f°";
"%.0f°C" = "%.0f°C";
"%.0f°C • %.0fW" = "%.0f°C • %.0fW";
"%.1f %@" = "%.1f %@";
"%.1f Ghz" = "%.1f Ghz";
"%.1f M/s" = "%.1f M/s";
"%.1f s" = "%.1f s";
"%.1f%%" = "%.1f%%";
"%.1f°C" = "%.1f°C";
"%.2f GHz" = "%.2f GHz";
"%.3f V" = "%.3f V";
"%.4f V" = "%.4f V";
"100°C" = "100 °C";
"1h" = "1t";
"24h" = "24t";
"30d" = "30d";
"60°C" = "60 °C";
"7d" = "7d";
"Accept & Continue" = "Godta og fortsett";
"Active" = "Aktiv";
"All Auto" = "Alle automatisk";
"All Combined" = "Alle Kombinerte";
"All Fans Auto" = "Alle vifter automatisk";
"AMD CPU Cores" = "AMD CPU kjerner";
"AMD Power Gadget recolecta datos automáticamente cada minuto." = "AMD Power Gadget recolecta datos automac:ticamente cada minutt.";
"AMD Processor Power Manager (PPM)" = "AMD Prosessor strømbehandler (PPM)";
"Analysis" = "Analyse";
"Apply" = "Bruk";
"Apply P-States?" = "Bruke P-status?";
"Arrange the order in which resource widgets appear. Click arrows to swap position." = "Ordne rekkefølgen for hvor ressurs widgetene vises. Klikk piler for å bytte posisjon.";
"Arrow Color" = "Farge på pil";
"Automatically switches EPP profiles based on live CPU load" = "Aktiverer automatisk EPP-profiler basert på direkte CPU-belastning";
"Average core frequency in GHz" = "Gjennomsnittlig kjernefrekvens i GHz";
"Average utilization over time" = "Gjennomsnittlig utnyttelse over tid";
"Avg Frequency" = "Gj.snittlig frekvens";
"Avg." = "Gj.snitt.";
"Avg: %.0f%%" = "Avg: %.0f%%";
"Balanced\n%.1f GHz" = "Balansert\n%.1f GHz";
"Base\n%.1f GHz" = "Base\n%.1f GHz";
"BIOS / Auto" = "BIOS / Auto";
"Buscando actualizaciones..." = "Buscando actualizaciones...";
"Bytes (Read)" = "Bytes (Lles)";
"Bytes (Write)" = "Bytes (glatt)";
"Cargando tendencias de telemetría..." = "Cargando tendencias de telemetría...";
"Chart Metric" = "Kart måltall";
"Chart Type" = "Diagram type";
"Charts require macOS 13+" = "Figurer krever macOS 13+";
"Charts require macOS 13.0+" = "Figurer krever macOS 13.0+";
"Check for new releases of SMCAMDProcessor and AMD Power Gadget on GitHub." = "Sjekk for nye utgivelser av SMCAMDProsessor og AMD Power Gadget på GitHub.";
"Check for Updates" = "Se etter oppdateringer";
"Check Now" = "Sjekk nå";
"Circular Ring" = "Sirkulær ring";
"Column Bars" = "Kolonne Barer";
"Configure Charts" = "Konfigurer diagrammer";
"Configure labels and layout details for widgets inside the popover." = "Konfigurer etiketter og oppsettdetaljer for moduler inne i sprettoppvinduet.";
"Connection Error: %@" = "Tilkoblingsfeil: %@";
"Continuous Background Logging" = "Kontinuerlig bakgrunnslogging";
"Continuously write telemetry samples to a CSV file in the background" = "Skriv stadig ut telemetriprøver til en CSV-fil i bakgrunnen";
"Control Mode" = "Kontroll Modus";
"Core Rankings (Estimated by Freq)" = "Kjernerangeringer (omrørt av Freq)";
"Could not fetch release info." = "Kunne ikke hente utgivelse info.";
"CPPC hardware rankings are active and loaded from the processor." = "CPPC maskinvarerangering er aktivert og lastet fra prosessoren.";
"CPPC hardware values could not be read. Rankings are estimated from the maximum observed clock frequency of each core." = "CPC maskinvareverdier kunne ikke leses. Rangeringer er estimert fra maksimal frekvens observert klokkefrekvens for hver kjerne.";
"CPPC Preferred Cores (Silicon Quality)" = "CPPC Foretrukne kjerner (Silicon Kvalitet)";
"CPPC: Active" = "CPPC: HW OK";
"CPPC: Estimated" = "CPPC: estimert";
"CPU and GPU temperatures" = "CPU og GPU temperatur";
"CPU Average Frequency" = "Gjennomsnittlig CPU-frekvens";
"CPU Freq Avg (GHz)" = "CPU Freq Avg (GHz)";
"CPU Frequency" = "CPU frekvens";
"CPU Load" = "Prosessor belastning";
"CPU Load (%)" = "Prosessor belastning (%)";
"CPU Package Power" = "CPU pakke styrke";
"CPU Per-Core Thread Load" = "CPU Per-Core Thread Last";
"CPU Power" = "CPU kraft";
"CPU Power (W)" = "CPU-kraft (W)";
"CPU Power Alert" = "CPU strømvarsel";
"CPU power has been at %.1fW (above limit of %dW) for over %d seconds!" = "Prosessorstyrken har vært på %.1fW (over grensen på %dW) i mer enn %d sekunder!";
"CPU Temp" = "Prosessor Temp";
"CPU Temp (°C)" = "CPU temp (°C)";
"CPU Temperature" = "CPU temperatur";
"CPU Temperature Alert" = "CPU temperatur varsel";
"CPU temperature has reached %.1f°C!" = "Prosessortemperaturen har nådd %.1f°C!";
"CPU Tracker" = "CPU tracker";
"Current version: v%@\nNew version: %@\n\nRelease Notes:\n%@" = "Nåværende versjon: v%@\nNy versjon: %@\n\nutgivelser:\n%@";
"Curve" = "Kurve";
"Curve Optimizer is only active when the AMDRyzenCPUPowerManagement kext supports Zen 3 SMU mailbox interface." = "Curve Optimizer er bare aktiv når AMDRyzenCPUPowerManagement kext støtter Zen 3 SMU mailbox grensesnitt.";
"Custom" = "Egendefinert";
"Customize the behavior and visibility of the menu bar popover." = "Tilpass adferden og synligheten til menylinjen.";
"Cyberpunk Neon" = "Cyberpunk Neon";
"Delete Point" = "Slett punkt";
"Device Utilization %" = "Utnyttelse i enhet %";
"Disable heavy visual effects if your system lacks Metal graphics acceleration." = "Deaktiver kraftige visuelle effekter hvis systemet mangler metall grafikkakselerasjon.";
"DISCLAIMER: This software interacts directly with low-level hardware control registers. By using it, you agree that absolute responsibility for any system instability, hardware damage, or alien invasion lies entirely with the user." = "DISCLAIMER: Denne programvaren interagerer direkte med et lavt nivå av maskinvarekontrollregistre. Ved å bruke den er du enig i at absolutt ansvar for enhver systemustabilitet, maskinvareskade eller fremmed invasjon er helt og holdt.";
"DISCLAIMER: This software interacts directly with low-level hardware control registers. By using it, you agree that absolute responsibility rests entirely with the user." = "DISCLAIMER: Denne programvaren interagerer direkte med et lavt nivå av maskinvarekontrollregistre. Ved å bruke den godtar du at absolutt ansvar helt reagerer med brukeren.";
"Disk" = "Disk";
"DISK" = "DISIKO";
"Disk Activity" = "Disk aktivitet";
"Disk Activity (MB/s)" = "Disk aktivitet (MB/s)";
"Disk Activity (Read+Write)" = "Diskaktivitet (les+Write)";
"Disk I/O" = "Disk I/U";
"Disk Tracker" = "Disk-tracker";
"Do you want AMD Power Gadget to start in menu bar at login? \n\n This will only be asked once. You can change this setting later under Appearance menu." = "Vil du at AMD strøm Gadget skal starte i menylinjen på innlogging? \n\n Dette vil bare bli spurt en gang. Du kan endre denne innstillingen senere under Utseende meny.";
"Donate (PayPal)" = "Doner (PayPal)";
"Download" = "Nedlasting";
"Download on GitHub" = "Last ned på GitHub";
"Download Update" = "Last ned oppdatering";
"Drag control points to edit curve. Double-click empty space to add (max 8). Double-click a point or right-click to delete." = "Dra kontrollpunktene for å redigere kurven. Dobbelklikk på tom plass for å legge til (maks 8). Dobbelklikk på et punkt eller høyreklikk for å slette.";
"Dynamic Auto-EPP Workload Engine" = "Dynamisk autoEPP arbeidsbelastningsmotor";
"Dynamic Next-Gen Fan Curves" = "Dynamiske Next-Gen Fan kurver";
"Edit Layout" = "Rediger oppsett";
"Efficient\n%.1f GHz" = "Effektiv\n%.1f GHz";
"Enable additional stats columns inside the popover." = "Aktiver ekstra statistikkkolonner inne i sprettopp-vinduet.";
"Enable System Alerts" = "Aktiver System varsler";
"Error reading CPU data." = "Feil i lesing av CPU-data.";
"Evaluated in the kernel with 256-step LUT interpolation, hysteresis, and smooth ramping." = "Evaluert i kjerneområdet med 256-trinns LUT-interpolasjon, hysteresis og glatt ramping.";
"Export" = "Eksporter";
"Export CSV" = "Eksportere CSV";
"Export Telemetry History" = "Eksporter telemetrihistorie";
"Export the history of samples currently in memory to a CSV file" = "Eksporter historien til prøver som er i minnet til en CSV-fil";
"Failed — check kext privileges (-amdpnopchk)." = "Mislyktes - sjekk kext rettigheter (-amdpnopchk).";
"Fan" = "Vifte";
"Fan Number" = "Vifte nummer";
"Fan Speed" = "Viftehastighet";
"Fan Speed (RPM)" = "Viftehastighet (RPM)";
"Fan Speed(RPM)" = "Vifte Speed(RPM)";
"Filled Area" = "Fylt område";
"Freq:" = "Ledig:";
"Frequency" = "Frekvens";
"Frequency Max:" = "Frekvens maksimum:";
"GHz" = "GHz";
"GitHub Repository" = "GitHub Repository";
"GitHub Repository\n\nSpecial thanks to the AMD OS X community!\n\nCopyright © 2020-2026 Droga. All rights reserved." = "GitHub Repository\n\nSpesiell takk til AMD OS X samfunnet!\n\nCopyright ©️ 2020-2026 Droga. Alle rettigheter reservert.";
"GPU Load" = "GPU last";
"GPU Model" = "GPU modell";
"GPU Power" = "GPU makt";
"GPU Power (W)" = "GPU strøm (W)";
"GPU Temp" = "GPU temp";
"GPU Temp (°C)" = "GPU temp (°C)";
"GPU Temperature" = "GPU temperatur";
"GPU Tracker" = "GPU tracker";
"H.264 & HEVC Active" = "H.264 & HEVC Aktiv";
"H.264 Active (HEVC Inactive)" = "H.264 Aktiv (HEVC Inaktiv)";
"HEVC Active (H.264 Inactive)" = "HEVC Aktiv (H.264 Inaktiv)";
"Hide this fan" = "Skjul denne viften";
"High Load Threshold (Performance)" = "Høyt lastterskel (ytelse)";
"Histograma de Barras" = "Histograma de Barras";
"Hysteresis" = "Hysteresis";
"I accept that absolute responsibility lies entirely with the user." = "Jeg aksepterer at det absolutte ansvaret ligger helt og holdent hos brukeren.";
"Idle Threshold (Power Save)" = "Ledig terskel (par spare)";
"Import" = "Importer";
"Inactive" = "Inaktiv";
"Inactive / Not Supported" = "Inaktiv / ikke støttet";
"Index" = "Indeks";
"Inject positive or negative voltage offsets per core. Center is 0 (no override). Limit: -30 (undervolt) to +30 (overvolt) counts." = "Injiser positive eller negative spenningsforskyvninger per kjerne. Senter er 0 (ingen overstyrings). Grense: -30 (undervolt) til +30 (overvolt) tellinger.";
"Inst(s) Retired:" = "Installering(er) pensjont:";
"Kext Update Available" = "Kext oppdatering tilgjengelig";
"Later" = "Senere";
"Line Only" = "Kun linje";
"Load" = "Last";
"Loading..." = "Laster...";
"Log File Location" = "Plassering av loggfiler";
"Logical Cores" = "Logiske kjerner";
"Low Performance Mode" = "Lav ytelsesmodus";
"Low Power\n%.1f GHz" = "Low Power\n%.1f GHz";
"Línea Escalonada (Step)" = "Li∙nea Escalonada (steg)";
"Línea Suave (Spline)" = "Liodarnea Suave (Splin)";
"Manual Override" = "Manuell overstyring";
"Max Speed" = "Maks hastighet";
"Max." = "Max.";
"MB/s" = "MB/s";
"Memory Usage" = "Minne brukt";
"Menu Bar Preview:" = "Forhåndsvisning av menylinje:";
"Mi Tema Custom" = "Tema er tilpasset";
"Min." = "Min.";
"Monochrome Stealth" = "Monokromt uskarpt";
"Máx." = "Maεx.";
"Máx:" = "Mapril x:";
"Mín." = "Mirakel/e";
"Mín:" = "Avl.presse:";
"N/A" = "N/A";
"Net" = "Netto";
"Net Download (MB/s)" = "Netto nedlasting (MB/s)";
"Net Upload (MB/s)" = "Netto opplasting (MB/s)";
"Network Speed" = "Nettverkets hastighet";
"Network Throughput" = "Antall nettverk";
"Network Total Speed" = "Nettverk total hastighet";
"New version %@ available!" = "Ny versjon %@ tilgjengelig!";
"New Version Available: %@" = "Ny versjon tilgjengelig: %@";
"No" = "Nei";
"No AMDRyzenCPUPowerManagement Found!" = "Ingen AMDRyzenCPUPowerManagement Found!";
"No curves configured." = "Ingen kurver er konfigurert.";
"No hay suficientes datos recolectados aún." = "No hay suficientes datos recolectados aún.";
"No location selected" = "Ingen posisjon valgt";
"No metrics active" = "Ingen måltall aktiv";
"No release notes available." = "Ingen utgivelsesnotater tilgjengelig.";
"Nordic Frost" = "Nordisk Frost";
"Not Supported" = "Støttes ikke";
"Not supported by your CPU" = "Ikke støttet av CPU-en";
"Not yet" = "Ikke ennå";
"Open Dashboard" = "Åpne dashbord";
"Other Popover Widgets" = "Andre Popover Widgets";
"P-State Editor" = "P-State redigeringsprogram";
"P-States applied successfully." = "P-statuser ble lagt til.";
"P-States Configuration" = "P-statskonfigurasjon";
"Package" = "Pakke";
"Package Power" = "Paknings styrke";
"Peak Fan" = "Topp vifte";
"Peak Freq" = "Høyeste Freq";
"Peak Power" = "Topp makt";
"Peak Temp" = "Topp temp";
"Performance\n%.1f GHz" = "Ytelse\n%.1f GHz";
"Performance & Fallback" = "Ytelse & Falltilbake";
"Personalizado" = "Personalizado";
"Physical Cores" = "Fysiske kjerner";
"Pin Popover Open" = "Fest Popover åpen";
"Platform" = "Plattform";
"Please download AMDRyzenCPUPowerManagement from the release page." = "Vennligst last ned AMDRyzenCPUPowerManagement fra utgivelsessiden.";
"Popover Config" = "Popover Config";
"Popover General Settings" = "Popover generelle innstillinger";
"Popover Menu" = "Popover Menu";
"Power" = "Makt";
"Power Warning Threshold (PPT)" = "Strøm varsel-terskel (PPT)";
"Prevent the popover from closing when clicking outside" = "Forhindre at sprettoppvinduet lukkes når du klikker utenfor";
"Preview" = "Forhåndsvisning";
"Processor" = "Prosessor";
"Profile" = "Profil";
"Progress Bar" = "Fremdriftslinje";
"Prom." = "Prom.";
"PWR" = "PWR";
"Quick Fan Access" = "Rask Viftetilgang";
"Quit" = "Avslutt";
"Quit and Download" = "Avslutt og last ned";
"Radeon GPU" = "Radeon GPU";
"Radeon Graphics utilization percentage" = "Andel utnyttelse av refleksjon om Grafikk";
"RAM" = "RAM";
"RAM Tracker" = "RAM Sporer";
"RAM Usage" = "RAM Usage";
"RAM Usage (%)" = "RAM Usage (%)";
"RAM Utilization" = "RAM Utilization";
"RAM utilization percentage" = "RAM utnyttelsesprosent";
"Ramp Rate" = "Rampe rate";
"Raw Register Details" = "Registreringsdetaljer for rå";
"Read Speed" = "Les hastighet";
"Real-time energy consumption in Watts" = "Energiforbruk i sanntid i watt";
"Real-time History" = "Sanntids historikk";
"Real-time upload / download speed (↑/↓)" = "Sanntids opplasting/nedlastingshastighet (↑/↓)";
"Receive native macOS alerts when the CPU exceeds configured thermal or power limits." = "Motta innebygde macOS varsler når CPU overskrider konfigurerte termiske eller strømbegrensninger.";
"Refresh Rate" = "Oppdater rate";
"Relative Time (s)" = "Relativ tid (er)";
"Replaces translucent blurs with solid colors to save CPU" = "Erstatter gjennomsiktige uklarheter i solide farger for å spare prosessorbehovet";
"Requests permission and enables hardware limit warnings" = "Forespørsler tillatelse og muliggjør maskinvaregrense advarsler";
"Revert" = "Tilbakestill";
"Right-click any widget directly on your desktop to change its style dynamically (Classic Glass, Pro Monitor, or Core Matrix)." = "Høyreklikk alle widget direkte på skrivebordet for å endre stilen dynamisk (Classic Glass, Pro Monitor, eller Core Matrix).";
"SAFETY DISCLAIMER & LIABILITY AGREEMENT" = "SIKKERHET DISCLAIMER & GJELD ADMINISTRASJON";
"Seleccioná una gráfica en el panel superior para visualizar su histórico." = "Seleccionaτ una-transplantatet en overordnet del av en modelleringsstudie med et su histofag.";
"Select File..." = "Velg fil...";
"Select which metrics are shown and choose their visualization style." = "Velg hvilke måltall som skal vises og velg hvilken visualiseringsstil som skal brukes.";
"Series" = "Serier";
"Show a floating, non-interactive widget on your desktop for live telemetry." = "Vis en flytende, ikke-interaktiv widget på skrivebordet for live telemografi.";
"Show All (%d hidden)" = "Vis alle (%d skjult)";
"Show CPU" = "Vis CPU";
"Show Fan RPM" = "Vis RPM vifte";
"Show GPU Power" = "Vis GPU-strøm";
"Show GPU Row" = "Vis GPU rad";
"Show GPU Temp" = "Vis GPU temp.";
"Show Memory" = "Vis minne";
"Show Network" = "Vis nettverk";
"Show Network Row" = "Vis nettverkets rad";
"Show Network Speed Sparkline Graph below" = "Vis nettverk hastighet søylediagram under";
"Show Per-Core Utilization Grid below" = "Vis ren utnyttelsesrutenett under";
"Show Power" = "Vis strøm";
"Show Ring Details" = "Vis ringetaljer";
"Show Ring Labels" = "Vis ringeetiketter";
"Show Temperature" = "Vis temperatur";
"Show Temperature Sparkline Graph below" = "Vis temperatur parkline graf nedenfor";
"Show Top Processes" = "Vis toppprosesser";
"Single large value instead of max/avg stack" = "Stor engangsverdi i stedet for max/avg stabel";
"SMC Fan Control" = "SMC Viftekontroll";
"Smooth Curves" = "Jevn kurver";
"Software" = "Programvare";
"Software Updates" = "Programvare oppdateringer";
"Solarized Amber" = "Solarisert Rav";
"Speed" = "Hastighet";
"SSD" = "SSD";
"Startup at login?" = "Oppstart ved innlogging?";
"Statistics" = "Statistikk";
"Storage" = "Lagring";
"Style" = "Stil";
"Style Options" = "Stil alternativer";
"Styles & Themes" = "Styles & Themes";
"Supported by your CPU" = "Støttet av CPU-en din";
"Sustained Duration" = "Vedvarende varighet";
"Swap Total" = "Bytte totalt";
"Swap Used" = "Bytte brukt";
"System Alert Notifications" = "System varslingsmeldinger";
"System Up to Date" = "System opp til dato";
"Tahoe Glass" = "Tahoe glass";
"Temp" = "Temp.";
"Temp Source" = "Temp Kilde";
"Temperature" = "Temperatur";
"Temperature Warning Threshold" = "Terskel for temperaturvarsling";
"Temperature(C)" = "Temperatur(C)";
"Temperatures" = "Temperaturer";
"Themes & Appearance" = "Temaer & utseende";
"Thermal History" = "Termisk historikk";
"This application can not be launched due to AMDRyzenCPUPowerManagement is reporting incorrect data." = "Denne applikasjonen kan ikke startes på grunn av AMDRyzenCPUPowerManagement rapporterer feilaktige data.";
"This software interacts directly with low-level CPU hardware registers, Model-Specific Registers (MSRs), and the System Management Unit (SMU) to control CPU voltages, frequencies, and power limits.\n\nIncorrect settings, unstable undervolting, or wrong configurations can cause system instability, data loss, kernel panics, or permanent hardware damage.\n\nBy continuing, you agree that absolute responsibility for any system instability, hardware damage, or alien invasion lies entirely with the user. The authors and contributors assume no liability whatsoever for any damage, loss, or side effects to your hardware, software, or personal property. Use at your own risk." = "Denne programvaren fungerer direkte med et CPU-maskinvareregister, Model-Specific Registere (MSRs), og systemadministrasjonsenheten (SMU) for å kontrollere CPU-spenninger, frekvenser og strømbegrensninger.\n\nFeil innstillinger, ustabil underspenning, eller feil konfigurasjoner kan forårsake systemustabilitet, datatap, kernel panikk eller permanent maskinvare skade.\n\nVed å fortsette er du enig i at absolutt ansvar for enhver systemustabilitet, maskinvare skade eller aliensk invasjon er helt avhengig av brukeren. Forfatterne og bidragsyterne antar ikke noe ansvar for skader, tap eller bivirkninger av maskinvare, programvare eller personlig eiendom. Bruk på egen risiko.";
"Thread %d: %.1f%%" = "Tråd %d: %.1f%%";
"Time" = "Tid";
"Timeframe" = "Timeframe";
"Timestamp" = "Tidsstempel";
"TMP" = "TMP";
"Todas las gráficas están ocultas." = "Todas las gráficas están ocultas.";
"Top Processes" = "Flest prosesser";
"Total" = "Totalt";
"Total Power(W)" = "Total Power(W)";
"Tracks active memory usage and pressure." = "Sporer aktiv minnebruk og trykk";
"Tracks CPU utilization average and core temperature." = "Sporer CPU-forbruk og kjernetemperatur.";
"Tracks graphics memory (VRAM) utilization." = "Sporings grafikkminne (VRAM) bruk.";
"Tracks graphics utilization and temperature." = "Sporer grafisk bruk og temperatur.";
"Tracks primary storage capacity usage." = "Spor primær lagringsplass bruk.";
"Unknown" = "Ukjent";
"Unknown GPU" = "Ukjent GPU";
"Unlock Curve Optimizer (DANGEROUS: unstable undervolting can cause kernel panic or instant reboot)" = "Lås opp kurvOptimizer (ANGEROUS: ustabil undervolt kan forårsake spansk eller øyeblikkelig omstart)";
"Unlock P-State Editor (DANGEROUS: incorrect settings can crash or damage hardware)" = "Lås opp P-Stat-redigeringsprogrammet (DANGEROUS: feil innstillinger kan krasje eller skade maskinvare)";
"Upload" = "Last opp";
"Uptime" = "Oppetid";
"Use Popover Menu" = "Bruk Popover menyen";
"Used memory in GB" = "Brukt minne i GB";
"Used RAM" = "Used RAM";
"UTC Time" = "UTC tid";
"V-F Operating Curve" = "V-F betjeningskurve";
"Value" = "Verdi";
"VDA Decoder" = "VDA dekoder";
"Visible charts:" = "Synlige diagrammer:";
"Volt:" = "Volt:";
"VRAM" = "VRAM";
"VRAM Tracker" = "VRAM Sporer";
"VRAM Used" = "VRAM brukt";
"VRAM: %.2fG%@" = "VRAM: %.2fG%@";
"W" = "V";
"Weekday" = "Ukedag";
"Widget Reordering" = "Omorganisering av widget";
"Widget Selection & Display Style" = "Widget valg & visningsstil";
"Widget Style" = "Widget stil";
"Write Speed" = "Skriv hastighet";
"Yes" = "Ja";
"You are running the most recent version of AMD Power Gadget (v%@)." = "Du kjører den nyeste versjonen av AMD Power Gadget (v%@).";
"You have the latest version installed (v%@)." = "Du har den nyeste versjonen installert (v%@).";
"°C" = "°C";
"Área Rellena (Gradient)" = "A∙rea Rellena (forløp)";

/* Compatibility / format keys */
"Your AMDRyzenCPUPowerManagement version (%@) is outdated and no longer API compatible. Please use version 3.0.0 or newer and start this application again." = "Din AMDRyzenCPUPowerManagement versjon (%@) er utdatert og ikke lenger API kompatibel. Vennligst bruk versjon 3.0.0 eller nyere og start denne applikasjonen på nytt.";

/* App language picker */
"Language" = "Språk";
"App Language" = "App språk";
"Choose the interface language. The app will restart to apply the change." = "Velg grensesnitt språk. Programmet startes på nytt for å bruke endringen.";
"System Default" = "Standard system";
"Current: %@" = "Nåværende: %@";
"Restart required" = "Omstart kreves";
"Apply & Restart" = "Bruk & start på nytt";
"The app needs to restart to load the selected language." = "Appen må starte på nytt for å laste det valgte språket.";

/* Privilege UX */
"This action requires administrator privileges. Run AMD Power Gadget as root, or add the boot argument -amdpnopchk for debugging." = "Denne handlingen krever administratorrettigheter. Kjør AMD Power Gadget som rot, eller legg til oppstartsargument -amdpnopchk for feilsøking.";

/* Crowdin: recent UI strings — CPPC badge vs EPP Active Mode */
"CPPC: HW OK" = "CPPC: HW OK";
"CPPC: EPP On" = "CPPC: EPP On";
"This CPU did not report CPPC support to the kext." = "This CPU did not report CPPC support to the kext.";
"If the switch snaps back to Off: enable writes with boot-arg -amdpnopchk (or run as root). The green “CPPC: HW OK” badge only means rankings exist — it is not this switch." = "If the switch snaps back to Off: enable writes with boot-arg -amdpnopchk (or run as root). The green “CPPC: HW OK” badge only means rankings exist — it is not this switch.";
"Native CPPC Active Mode (EPP) is ON. Cores scale autonomously; rankings come from the processor." = "Native CPPC Active Mode (EPP) is ON. Cores scale autonomously; rankings come from the processor.";
"CPPC hardware scores could not be read. Rankings are estimated from observed clocks. This is not the Profiles EPP toggle." = "CPPC hardware scores could not be read. Rankings are estimated from observed clocks. This is not the Profiles EPP toggle.";
"The CPU reports CPPC rankings (HW OK). That does not mean Active Mode is on — enable “Native CPPC Active Mode (EPP)” under Profiles (needs -amdpnopchk or root)." = "The CPU reports CPPC rankings (HW OK). That does not mean Active Mode is on — enable “Native CPPC Active Mode (EPP)” under Profiles (needs -amdpnopchk or root).";
/* Deprecated badge key — kept so old locales still resolve */
"CPPC: Active" = "CPPC: HW OK";

/* Menu Bar toggles (fabiosun IT) */
"Show Max Freq Only" = "Show Max Freq Only";

/* Menu Bar toggles (fabiosun IT) */
"Use Fahrenheit" = "Use Fahrenheit";

/* Menu Bar toggles (fabiosun IT) */
"Frequency column (max/avg GHz)" = "Frequency column (max/avg GHz)";

/* Menu Bar toggles (fabiosun IT) */
"CPU temp + optional GPU temp" = "CPU temp + optional GPU temp";

/* Menu Bar toggles (fabiosun IT) */
"Convert temperature values from Celsius to Fahrenheit" = "Convert temperature values from Celsius to Fahrenheit";

/* Menu Bar toggles (fabiosun IT) */
"CPU watts + optional GPU watts" = "CPU watts + optional GPU watts";

/* CPPC support gate */
"Active Mode and Auto-EPP stay off until the kext reports CPPC. Boot-arg -amdcppcactive alone is not enough if MSR/CPUID checks fail — reboot after updating kexts." = "Active Mode and Auto-EPP stay off until the kext reports CPPC. Boot-arg -amdcppcactive alone is not enough if MSR/CPUID checks fail — reboot after updating kexts.";
"AMDRyzenCPUPowerManagement kext not connected." = "AMDRyzenCPUPowerManagement kext not connected.";
"If the switch snaps back to Off: enable writes with boot-arg -amdpnopchk (or run as root). With -amdcppcactive the kext enables Active Mode at boot after reboot." = "If the switch snaps back to Off: enable writes with boot-arg -amdpnopchk (or run as root). With -amdcppcactive the kext enables Active Mode at boot after reboot.";
"Checking for updates..." = "Checking for updates...";
